; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v12 ?v4)
             (pred_11 ?v6 ?v1)
             (pred_6 ?v12 ?v1)
             (pred_3 ?v8 ?v12 )
	     (pred_5 ?v12)
             (pred_2 ?v5)
             (pred_9 ?v6)
             (pred_12 ?v1)
             (pred_4 ?v12)
             (pred_7 ?v6)
             (pred_10 ?v12)
             (pred_1 ))



(:action op_2
:parameters (?v9 ?v11 ?v13 ?v10)
:precondition (and (pred_2 ?v9) (pred_2 ?v11) (pred_9 ?v13) (pred_12 ?v10)
          (pred_8 ?v9 ?v11) (pred_11 ?v13 ?v10)
                   (pred_6 ?v11 ?v10) (pred_5 ?v9) 
                   (pred_4 ?v11) (pred_7 ?v13))
:effect (and  (pred_10 ?v11) (not (pred_4 ?v11))))


(:action op_1
:parameters (?v9 ?v7)
:precondition (and (pred_2 ?v9) (pred_2 ?v7)
               (pred_5 ?v9) (pred_8 ?v9 ?v7) (pred_10 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v9))))

(:action op_4
:parameters (?v9 ?v13)
:precondition (and (pred_2 ?v9) (pred_9 ?v13) 
                  (pred_5 ?v9) (pred_3 ?v13 ?v9) (pred_1 ))
:effect (and (pred_7 ?v13)
   (not (pred_3 ?v13 ?v9)) (not (pred_1 ))))


(:action op_3
:parameters (?v9 ?v3 ?v2)
:precondition (and (pred_2 ?v9) (pred_9 ?v3) (pred_9 ?v2)
                  (pred_5 ?v9) (pred_7 ?v2) (pred_3 ?v3 ?v9))
:effect (and (pred_7 ?v3) (pred_3 ?v2 ?v9)
        (not (pred_7 ?v2)) (not (pred_3 ?v3 ?v9))))

(:action op_5
:parameters (?v9 ?v13)
:precondition (and (pred_2 ?v9) (pred_9 ?v13) 
                  (pred_5 ?v9) (pred_7 ?v13))
:effect (and (pred_1 ) (pred_3 ?v13 ?v9) (not (pred_7 ?v13)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_13 obj_08 obj_02 obj_20 obj_09 obj_14 obj_12 obj_18 obj_03 obj_06 obj_01 obj_04 obj_05 obj_11 obj_15
    obj_07 obj_17
    obj_16 obj_10
    )

    (:init
       (pred_1)

       (pred_2 obj_19)
       (pred_2 obj_13)
       (pred_2 obj_08)
       (pred_2 obj_02)
       (pred_2 obj_20)
       (pred_2 obj_09)
       (pred_2 obj_14)
       (pred_2 obj_12)
       (pred_2 obj_18)
       (pred_2 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_01)
       (pred_2 obj_04)
       (pred_2 obj_05)
       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_12 obj_07)
       (pred_12 obj_17)
       (pred_9 obj_16)
       (pred_9 obj_10)

       (pred_8 obj_19 obj_20)
       (pred_8 obj_19 obj_13)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_19)
       (pred_8 obj_08 obj_14)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_02 obj_12)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_20 obj_19)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_09 obj_13)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_14 obj_12)
       (pred_8 obj_14 obj_08)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_02)
       (pred_8 obj_12 obj_14)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_03)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_03 obj_05)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_03 obj_09)
       (pred_8 obj_03 obj_18)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_06 obj_01)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_01 obj_15)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_01 obj_06)
       (pred_8 obj_04 obj_05)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_05 obj_11)
       (pred_8 obj_05 obj_03)
       (pred_8 obj_05 obj_04)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_11 obj_06)
       (pred_8 obj_11 obj_05)
       (pred_8 obj_15 obj_01)
       (pred_8 obj_15 obj_11)
       (pred_4 obj_02)
       (pred_4 obj_05)
       (pred_6  obj_02 obj_07)
       (pred_6  obj_05 obj_17)
       (pred_10 obj_19)
       (pred_10 obj_13)
       (pred_10 obj_08)
       (pred_10 obj_20)
       (pred_10 obj_09)
       (pred_10 obj_14)
       (pred_10 obj_12)
       (pred_10 obj_18)
       (pred_10 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_11)
       (pred_10 obj_15)

       (pred_11  obj_16 obj_07)
       (pred_11  obj_10 obj_17)
       (pred_3 obj_16 obj_09)
       (pred_3 obj_10 obj_01)
       (pred_5 obj_04)
    )

    (:goal (and
       (pred_3 obj_16 obj_15)
       (pred_3 obj_10 obj_20)
    ))
(:constraints
  (always (not (pred_5 obj_14)))
)
)

; plan
1. (op_1 obj_04 obj_18)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_18)
   goals met: 0 of 2
2. (op_1 obj_18 obj_03)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_03)
   goals met: 0 of 2
3. (op_1 obj_03 obj_06)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_06)
   goals met: 0 of 2
4. (op_1 obj_06 obj_01)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_01)
   goals met: 0 of 2
5. (op_4 obj_01 obj_10)
   deleted: (pred_3 obj_10 obj_01) (pred_1)
   added: (pred_7 obj_10)
   goals met: 0 of 2
6. (op_1 obj_01 obj_06)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_06)
   goals met: 0 of 2
7. (op_1 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_03)
   goals met: 0 of 2
8. (op_1 obj_03 obj_09)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_09)
   goals met: 0 of 2
9. (op_1 obj_09 obj_20)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_20)
   goals met: 0 of 2
10. (op_5 obj_20 obj_10)
   deleted: (pred_7 obj_10)
   added: (pred_1) (pred_3 obj_10 obj_20)
   goals met: 1 of 2
11. (op_1 obj_20 obj_09)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_09)
   goals met: 1 of 2
12. (op_4 obj_09 obj_16)
   deleted: (pred_3 obj_16 obj_09) (pred_1)
   added: (pred_7 obj_16)
   goals met: 1 of 2
13. (op_1 obj_09 obj_03)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_03)
   goals met: 1 of 2
14. (op_1 obj_03 obj_06)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_06)
   goals met: 1 of 2
15. (op_1 obj_06 obj_01)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_01)
   goals met: 1 of 2
16. (op_1 obj_01 obj_15)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_15)
   goals met: 1 of 2
17. (op_5 obj_15 obj_16)
   deleted: (pred_7 obj_16)
   added: (pred_1) (pred_3 obj_16 obj_15)
   goals met: 2 of 2
